Witali/yoRadio/idf/esp32c3-oled-native/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_FREERTOS_UNICORE=y
CONFIG_FREERTOS_HZ=1000
# Eight TCP segments cover the bandwidth-delay product of remote 320 kbit/s
# radio servers without reserving the much larger 16-32 KiB windows.
CONFIG_LWIP_TCP_WND_DEFAULT=11520
# ESP-IDF recommends receive-window/MSS + 2 mailbox entries.
CONFIG_LWIP_TCP_RECVMBOX_SIZE=10

CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# The proven software scroll is the board default. Hardware scrolling remains
# available for experiments through menuconfig.
# CONFIG_YORADIO_OLED_HW_SCROLL is not set

# The board USB-C connector is wired to the ESP32-C3 USB Serial/JTAG block.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n
CONFIG_LIBC_NEWLIB_NANO_FORMAT=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL=3
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_ESP_COREDUMP_ENABLE_TO_NONE=y
CONFIG_HEAP_POISONING_DISABLED=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=n
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=n

# This exact OLED board has an ordinary active-low blue LED on GPIO8.
CONFIG_YORADIO_AUDIO_LEVEL_LED=y
CONFIG_YORADIO_AUDIO_LEVEL_LED_GPIO=8
CONFIG_YORADIO_AUDIO_LEVEL_LED_ACTIVE_LOW=y
CONFIG_YORADIO_AUDIO_LEVEL_LED_PWM_HZ=5000
CONFIG_YORADIO_AUDIO_LEVEL_LED_MAX_BRIGHTNESS=255
CONFIG_YORADIO_AUDIO_LEVEL_LED_UPDATE_MS=50
CONFIG_YORADIO_AUDIO_LEVEL_LED_DECAY_STEP=8
# CONFIG_YORADIO_ROTARY_ENCODER is not set

# Native decoder set. Only one decoder instance is created at a time.
CONFIG_AUDIO_DECODER_AAC_SUPPORT=y
CONFIG_AUDIO_DECODER_MP3_SUPPORT=y
CONFIG_AUDIO_DECODER_FLAC_SUPPORT=y
CONFIG_AUDIO_DECODER_OPUS_SUPPORT=y
CONFIG_AUDIO_DECODER_VORBIS_SUPPORT=y
CONFIG_AUDIO_DECODER_G711_SUPPORT=n
CONFIG_AUDIO_DECODER_AMRNB_SUPPORT=n
CONFIG_AUDIO_DECODER_AMRWB_SUPPORT=n
CONFIG_AUDIO_DECODER_ADPCM_SUPPORT=n
CONFIG_AUDIO_DECODER_ALAC_SUPPORT=n
CONFIG_AUDIO_DECODER_PCM_SUPPORT=n
CONFIG_AUDIO_DECODER_SBC_SUPPORT=n
CONFIG_AUDIO_DECODER_LC3_SUPPORT=n
CONFIG_AUDIO_DECODER_G722_SUPPORT=n
CONFIG_AUDIO_SIMPLE_DEC_OGG_SUPPORT=y
CONFIG_AUDIO_SIMPLE_DEC_WAV_SUPPORT=n
CONFIG_AUDIO_SIMPLE_DEC_M4A_SUPPORT=n
CONFIG_AUDIO_SIMPLE_DEC_TS_SUPPORT=n
CONFIG_AUDIO_ENCODER_AAC_SUPPORT=n
CONFIG_AUDIO_ENCODER_G711_SUPPORT=n
CONFIG_AUDIO_ENCODER_AMRNB_SUPPORT=n
CONFIG_AUDIO_ENCODER_AMRWB_SUPPORT=n
CONFIG_AUDIO_ENCODER_OPUS_SUPPORT=n
CONFIG_AUDIO_ENCODER_ADPCM_SUPPORT=n
CONFIG_AUDIO_ENCODER_ALAC_SUPPORT=n
CONFIG_AUDIO_ENCODER_PCM_SUPPORT=n
CONFIG_AUDIO_ENCODER_SBC_SUPPORT=n
CONFIG_AUDIO_ENCODER_LC3_SUPPORT=n
CONFIG_AUDIO_ENCODER_G722_SUPPORT=n

# Select exactly one implementation for each codec. Espressif MP3 has the best
# measured C3 real-time headroom and is the native default. Helix AAC remains
# stable across mixed-codec transitions; custom FLAC remains the default FLAC
# implementation.
CONFIG_YORADIO_MP3_DECODER_ESPRESSIF=y
# CONFIG_YORADIO_MP3_DECODER_HELIX is not set
# CONFIG_YORADIO_MP3_DECODER_MINIMP3 is not set
# CONFIG_YORADIO_AAC_DECODER_ESPRESSIF is not set
CONFIG_YORADIO_AAC_DECODER_HELIX=y
CONFIG_YORADIO_FLAC_DECODER_CUSTOM=y
# CONFIG_YORADIO_FLAC_DECODER_ESPRESSIF is not set

CONFIG_BT_ENABLED=n
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n
CONFIG_ESP_WIFI_ENABLE_SAE_PK=n
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=n
CONFIG_LWIP_PPP_SUPPORT=n
CONFIG_LWIP_IPV6=n
CONFIG_LWIP_SNTP_MAX_SERVERS=2

CONFIG_ESP_HTTP_CLIENT_SAVE_RESPONSE_HEADERS=y
CONFIG_ESP_HTTP_CLIENT_MAX_SAVED_RESPONSE_HEADERS=24
CONFIG_ESP_HTTP_CLIENT_MAX_RESPONSE_HEADER_SIZE=128
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_YORADIO_WEB_SEND_TIMEOUT_SECONDS=20
CONFIG_YORADIO_WEB_STATIC_WORKERS=2
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Keep the full 16 KiB receive record for radio compatibility, while the
# request side needs only small GET headers.
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
# Keep one RX/TX allocation for the lifetime of a TLS connection. Reallocating
# record buffers while Wi-Fi and a decoder are active fragments the C3 heap.
# CONFIG_MBEDTLS_DYNAMIC_BUFFER is not set

CONFIG_SPIFFS_USE_MAGIC=y
CONFIG_SPIFFS_USE_MAGIC_LENGTH=y
CONFIG_SPIFFS_META_LENGTH=0
CONFIG_VFS_SUPPORT_SELECT=n
CONFIG_VFS_SUPPORT_TERMIOS=n
CONFIG_VFS_INITIALIZE_DEV_NULL=n
